app/controllers/pins_controller.rb

  def pinsof
    @user_id = params[:user_id]
    @user_id = User.find(@user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @pin = Pin.new(pin_params)
    @pin.user_id=(current_user.id)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("photo", "description", "created_at", "updated_at", "name", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "name" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["name", "Noche"], ["updated_at", "2018-05-27 20:34:29.150930"], ["id", 1]]